request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.example.org/cows/">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getHerdRequest>
            <herd>
            	<id>Test2</id>
            </herd>
        </gs:getHerdRequest>
    </soapenv:Body>
</soapenv:Envelope>
